{
  "news": [
    {
      "categories": "culture",
      "id": 8,
      "category": "culture",
      "title": "Nuevas Tendencias en la Moda Urbana",
      "image": "https://example.com/moda_urbana.jpg",
      "content": "La moda urbana ha experimentado una evolución significativa, con nuevas tendencias que están marcando el camino entre los jóvenes. El estilo 'streetwear' ha adoptado un enfoque más sostenible y minimalista, con marcas emergentes que apuestan por el uso de materiales reciclados y prácticas éticas de producción. Esta transición refleja un cambio en las prioridades de los consumidores, que ahora valoran la sostenibilidad tanto como el estilo. Además, la moda urbana sigue siendo una forma clave de expresión personal y cultural, con diseños que incorporan influencias del arte callejero y las subculturas urbanas.",
      "author": "Andrea Morales",
      "date": "2024/05/05",
      "views": 13000
    },
    {
      "categories": "culture",
      "id": 9,
      "category": "culture",
      "title": "Cultura Graffiti en las Grandes Ciudades",
      "image": "https://example.com/graffiti_cultura.jpg",
      "content": "El graffiti se ha consolidado como una forma legítima de arte urbano y protesta social en muchas de las grandes ciudades del mundo, como Nueva York, Berlín y Ciudad de México. Lo que alguna vez fue considerado vandalismo, ahora es reconocido como una poderosa herramienta de expresión artística, utilizada para abordar temas sociales, políticos y culturales. Los artistas de graffiti están ganando un reconocimiento cada vez mayor en el mundo del arte contemporáneo, y algunas de sus obras incluso han llegado a galerías y museos. Este cambio en la percepción del graffiti refleja una evolución en cómo las sociedades urbanas valoran el arte y la protesta.",
      "author": "Fernando Gutiérrez",
      "date": "2024/06/15",
      "views": 12500
    },
    {
      "categories": "sustainability",
      "id": 10,
      "category": "sustainability",
      "title": "Nuevas Energías Renovables Impulsan el Futuro",
      "image": "https://example.com/energias_renovables.jpg",
      "content": "Las energías renovables están creciendo rápidamente y se están convirtiendo en un pilar clave en la lucha contra el cambio climático. La energía solar y eólica son las principales protagonistas de esta revolución, y su expansión global está proporcionando alternativas más limpias y sostenibles frente a los combustibles fósiles. Muchos países han incrementado su inversión en infraestructura renovable, y las tecnologías continúan mejorando, lo que reduce los costos y aumenta la eficiencia. Esta transición hacia energías más limpias es crucial no solo para reducir las emisiones de carbono, sino también para crear un futuro más sostenible para las próximas generaciones.",
      "author": "Carolina Navarro",
      "date": "2024/04/10",
      "views": 18000
    },
    {
      "categories": "sustainability",
      "id": 11,
      "category": "sustainability",
      "title": "Supermercados Libres de Plástico: Una Realidad",
      "image": "https://example.com/supermercado_sin_plastico.jpg",
      "content": "Varios supermercados en Europa y América Latina han comenzado a eliminar el uso de plásticos de un solo uso en sus productos, promoviendo el uso de envases reutilizables y biodegradables. Esta iniciativa está ganando tracción como una solución eficaz para reducir la contaminación por plásticos, que representa una amenaza significativa para los ecosistemas marinos y terrestres. Algunos supermercados han implementado secciones libres de plástico, donde los productos se venden a granel y los clientes pueden llevar sus propios envases reutilizables. Esta tendencia refleja un cambio en los hábitos de consumo y un mayor enfoque en la sostenibilidad.",
      "author": "Miguel Sánchez",
      "date": "2024/08/20",
      "views": 14500
    },
    {
      "categories": "sustainability",
      "id": 12,
      "category": "sustainability",
      "title": "Ciudades Sostenibles: El Futuro Urbano",
      "image": "https://example.com/ciudades_sostenibles.jpg",
      "content": "Las ciudades verdes y sostenibles están transformando la vida urbana, ofreciendo soluciones innovadoras para reducir el impacto ambiental y mejorar la calidad de vida de sus habitantes. Iniciativas en ciudades como Copenhague y Singapur están liderando el camino hacia un futuro más ecológico, con la creación de espacios verdes, la promoción de la movilidad eléctrica y la implementación de tecnologías inteligentes para gestionar los recursos de manera eficiente. Estas ciudades están adoptando un enfoque holístico hacia la sostenibilidad, integrando prácticas ecológicas en todas las facetas de la vida urbana, desde la construcción de edificios hasta el transporte público.",
      "author": "Lucía Ortega",
      "date": "2024/09/02",
      "views": 16500
    },
    {
      "id": 13,
      "category": "lifestyle",
      "title": "Los Juegos Olímpicos 2024 Serán Más Verdes",
      "image": "https://example.com/juegos_olimpicos_verdes.jpg",
      "content": "Los organizadores de los Juegos Olímpicos de París 2024 han anunciado que será el evento olímpico más ecológico hasta la fecha. El objetivo es reducir significativamente las emisiones de carbono mediante el uso de energía renovable en las instalaciones y el transporte, así como la implementación de medidas de reciclaje y reducción de residuos. Los estadios están siendo construidos con materiales sostenibles, y se espera que el impacto ambiental del evento sea mucho menor en comparación con ediciones anteriores. Este enfoque en la sostenibilidad refleja un compromiso creciente por parte de las organizaciones deportivas de minimizar su huella ecológica.",
      "author": "Pedro Ruiz",
      "date": "2024/09/10",
      "views": 19000
    },
    {
      "id": 15,
      "category": "lifestyle",
      "title": "El Futuro del Fútbol Femenino",
      "image": "https://example.com/futbol_femenino.jpg",
      "content": "El fútbol femenino sigue ganando popularidad a nivel mundial, con audiencias récord y más ligas profesionales que nunca. La creciente visibilidad de los torneos de fútbol femenino, como la Copa Mundial Femenina, ha jugado un papel crucial en este crecimiento. Más patrocinadores están invirtiendo en el deporte, y las jugadoras están recibiendo salarios más competitivos. Esta evolución no solo está transformando el fútbol femenino en un espectáculo global, sino que también está abriendo nuevas oportunidades para las mujeres en el deporte, tanto dentro como fuera del campo. La igualdad de género en el deporte sigue siendo un tema importante, y el fútbol femenino está a la vanguardia de este cambio.",
      "author": "Sara Delgado",
      "date": "2024/08/25",
      "views": 16500
    },
    {
      "id": 16,
      "category": "lifestyle",
      "title": "Nuevas Normas de Privacidad en Internet para Niños",
      "image": "https://example.com/privacidad_infantil.jpg",
      "content": "Nuevas leyes en varios países han impuesto límites más estrictos sobre cómo las empresas pueden recopilar y utilizar los datos de niños menores de 13 años. Estas regulaciones buscan proteger la privacidad infantil en línea, en un momento en que las preocupaciones sobre el uso indebido de datos personales están en aumento. Los padres ahora tienen más control sobre la información que se comparte en plataformas digitales, y las empresas enfrentan sanciones severas si no cumplen con estas nuevas normativas. Estas medidas han sido bien recibidas por defensores de la privacidad y derechos digitales.",
      "author": "Laura Muñoz",
      "date": "2024/08/20",
      "views": 12000
    },
    {
      "id": 17,
      "category": "lifestyle",
      "title": "Apps Educativas Bajo la Lupa por Seguridad",
      "image": "https://example.com/apps_educativas_seguridad.jpg",
      "content": "Diversas plataformas educativas que son utilizadas por millones de niños en todo el mundo están siendo revisadas para asegurar que cumplen con las normativas de seguridad infantil, tras varios incidentes recientes en los que se violaron datos de menores. Los expertos en seguridad cibernética advierten que muchas de estas apps no cuentan con suficientes medidas de protección, lo que deja a los usuarios vulnerables a ciberataques y robo de datos. Las empresas responsables de estas aplicaciones están trabajando para mejorar sus sistemas de seguridad y garantizar que la información de los niños esté protegida.",
      "author": "Andrés Silva",
      "date": "2024/09/10",
      "views": 15
    },
    {
      "id": 18,
      "category": "lifestyle",
      "title": "Protección Legal para Compras Online Infantiles",
      "image": "https://example.com/proteccion_compras_online.jpg",
      "content": "Nuevas leyes han sido implementadas en varios países para proteger a los niños de realizar compras no autorizadas en línea, a menudo sin el conocimiento de sus padres. Estas compras, que se realizan a través de aplicaciones y videojuegos, han generado miles de quejas de padres que se han visto sorprendidos por cargos en sus cuentas bancarias. Las medidas incluyen la implementación de controles parentales más estrictos y la necesidad de verificación adicional antes de que se puedan realizar transacciones. Estas regulaciones buscan frenar el abuso y proteger tanto a los menores como a sus familias de los gastos inesperados.",
      "author": "Elena Vargas",
      "date": "2024/09/05",
      "views": 25
    },
    {
      "category": "",
      "title": "CRUD en React",
      "image": "",
      "content": "probando react",
      "author": "Javiana",
      "date": "2024-09-30T14:04:11.122Z",
      "views": 0,
      "id": 19
    },
    {
      "category": "lifestyle",
      "title": "asdasdasd",
      "image": "",
      "content": "asdasdasd",
      "author": "aasasdasd",
      "date": "2024-09-30T14:13:28.685Z",
      "views": 0,
      "id": 20
    },
    {
      "category": "",
      "title": "hola que tal",
      "image": "",
      "content": "asdasdawdadw",
      "author": "Javi",
      "date": "2024-09-30T14:17:27.636Z",
      "views": 0,
      "id": 21
    }
  ],
  "comments": [
    {
      "id": 10,
      "newId": 8,
      "author": "Daniel Hernández",
      "comment": "Interesante ver cómo la moda urbana sigue evolucionando hacia un enfoque más sostenible.",
      "likes": 78
    }
  ]
}